# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1, 5, size=100))
s2 = pd.Series(np.random.randint(1, 3, size=100))
s3 = pd.Series(np.random.randint(10000, 30000, size=100))
print(s1, s2, s3)

0     2
1     4
2     1
3     3
4     3
     ..
95    2
96    2
97    1
98    4
99    2
Length: 100, dtype: int64 0     1
1     2
2     1
3     1
4     2
     ..
95    2
96    1
97    2
98    2
99    2
Length: 100, dtype: int64 0     12344
1     25969
2     27779
3     26989
4     22646
      ...
95    15399
96    14861
97    27731
98    11998
99    16815
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1, s2, s3], axis=1)
df

    0  1      2
0   2  1  12344
1   4  2  25969
2   1  1  27779
3   3  1  26989
4   3  2  22646
.. .. ..    ...
95  2  2  15399
96  2  1  14861
97  1  2  27731
98  4  2  11998
99  2  2  16815

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
df = df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'})
df

    bedrs  bathrs  price_sqr_meter
0       2       1            12344
1       4       2            25969
2       1       1            27779
3       3       1            26989
4       3       2            22646
..    ...     ...              ...
95      2       2            15399
96      2       1            14861
97      1       2            27731
98      4       2            11998
99      2       2            16815

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
# Concatenate the Series vertically
combined_series = pd.concat([s1, s2, s3], axis=0)

# Create a DataFrame with this single column
bigcolumn = pd.DataFrame(combined_series)
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       4
2       1
3       3
4       3
..    ...
95  15399
96  14861
97  27731
98  11998
99  16815

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [7]:
len(bigcolumn)

# false, it should go to index 299.

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
# drop=True → throw away the old index instead of keeping it as a column.
# inplace=True → modify bigcolumn directly instead of returning a new DataFrame/Series.

bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        4
2        1
3        3
4        3
..     ...
295  15399
296  14861
297  27731
298  11998
299  16815

[300 rows x 1 columns]